lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
#include <stddef.h>
#include <stdbool.h>
#include <stdint.h>

#include "nrf54l15_vpr_transport_shared.h"

#define VPRCSR_NORDIC_VPRNORDICCTRL 0x7C0U
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL 0x7C1U
#define VPRCSR_NORDIC_TASKS 0x7E0U
#define VPRCSR_NORDIC_EVENTS 0x7E2U
#define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Msk (1UL << 0U)
#define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos 16U
#define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Enabled 0x507DUL
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_HIBERNATE 0xFU
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Msk (1UL << 17U)

#define BLE_CS_MAIN_MODE2 0x02U

#define BLE_CS_HCI_OP_READ_REMOTE_SUPPORTED_CAPABILITIES 0x208AU
#define BLE_CS_HCI_OP_SECURITY_ENABLE 0x208CU
#define BLE_CS_HCI_OP_SET_DEFAULT_SETTINGS 0x208DU
#define BLE_CS_HCI_OP_CREATE_CONFIG 0x2090U
#define BLE_CS_HCI_OP_SET_PROCEDURE_PARAMETERS 0x2093U
#define BLE_CS_HCI_OP_PROCEDURE_ENABLE 0x2094U
#define VPR_HCI_OP_VENDOR_PING 0xFCF0U
#define VPR_HCI_OP_VENDOR_GET_TRANSPORT_INFO 0xFCF1U
#define VPR_HCI_OP_VENDOR_FNV1A32 0xFCF2U
#define VPR_HCI_OP_VENDOR_GET_CAPABILITIES 0xFCF3U
#define VPR_HCI_OP_VENDOR_CRC32 0xFCF4U
#define VPR_HCI_OP_VENDOR_CRC32C 0xFCF5U
#define VPR_HCI_OP_VENDOR_TICKER_CONFIGURE 0xFCF6U
#define VPR_HCI_OP_VENDOR_TICKER_READ_STATE 0xFCF7U
#define VPR_HCI_OP_VENDOR_ENTER_HIBERNATE 0xFCF8U
#define VPR_HCI_OP_VENDOR_TICKER_EVENT_CONFIGURE 0xFCF9U

#define VPR_VENDOR_SERVICE_VERSION_MAJOR 1U
#define VPR_VENDOR_SERVICE_VERSION_MINOR 5U
#define VPR_VENDOR_OP_PING (1UL << 0U)
#define VPR_VENDOR_OP_INFO (1UL << 1U)
#define VPR_VENDOR_OP_FNV1A32 (1UL << 2U)
#define VPR_VENDOR_OP_CAPABILITIES (1UL << 3U)
#define VPR_VENDOR_OP_CRC32 (1UL << 4U)
#define VPR_VENDOR_OP_CRC32C (1UL << 5U)
#define VPR_VENDOR_OP_TICKER_CONFIGURE (1UL << 6U)
#define VPR_VENDOR_OP_TICKER_READ_STATE (1UL << 7U)
#define VPR_VENDOR_OP_ENTER_HIBERNATE (1UL << 8U)
#define VPR_VENDOR_OP_TICKER_EVENT_CONFIGURE (1UL << 9U)
#define VPR_VENDOR_TRANSPORT_FLAG_RESTORED_FROM_HIBERNATE 0x80U
#define VPR_VENDOR_EVENT_TICKER 0xA0U

#define BLE_CS_HCI_EVT_READ_REMOTE_SUPPORTED_CAPS_COMPLETE_V2 0x38U
#define BLE_CS_HCI_EVT_SECURITY_ENABLE_COMPLETE 0x2EU
#define BLE_CS_HCI_EVT_CONFIG_COMPLETE 0x2FU
#define BLE_CS_HCI_EVT_PROCEDURE_ENABLE_COMPLETE 0x30U
#define BLE_CS_HCI_EVT_SUBEVENT_RESULT 0x31U
#define BLE_CS_HCI_EVT_SUBEVENT_RESULT_CONTINUE 0x32U

#define BLE_HCI_PACKET_TYPE_EVENT 0x04U
#define BLE_HCI_EVT_COMMAND_COMPLETE 0x0EU
#define BLE_HCI_EVT_COMMAND_STATUS 0x0FU
#define BLE_HCI_EVT_LE_META 0x3EU
#define BLE_HCI_EVT_VENDOR 0xFFU

extern uint8_t __stack_top[];

static volatile Nrf54l15VprTransportHostShared* const g_host_transport =
    (volatile Nrf54l15VprTransportHostShared*)(uintptr_t)NRF54L15_VPR_TRANSPORT_HOST_BASE;
static volatile Nrf54l15VprTransportVprShared* const g_vpr_transport =
    (volatile Nrf54l15VprTransportVprShared*)(uintptr_t)NRF54L15_VPR_TRANSPORT_VPR_BASE;

static uint32_t g_ticker_enabled = 0U;
static uint32_t g_ticker_period_ticks = 0U;
static uint32_t g_ticker_step = 1U;
static uint32_t g_ticker_accum = 0U;
static uint32_t g_ticker_count = 0U;
static uint32_t g_ticker_event_enabled = 0U;
static uint32_t g_ticker_event_emit_every = 0U;
static uint32_t g_ticker_event_last_emitted_count = 0U;
static uint32_t g_ticker_event_pending_count = 0U;
static uint32_t g_ticker_event_drop_count = 0U;
static uint32_t g_pending_hibernate = 0U;
static uint32_t g_restored_from_hibernate = 0U;

static bool host_request_pending(void);

static inline void fence_rw(void) {
  __asm__ volatile("fence rw, rw" ::: "memory");
}

static inline void enable_machine_interrupts(void) {
  const uint32_t mie_mask = 0x8U;
  __asm__ volatile("csrs mstatus, %0" : : "r"(mie_mask) : "memory");
}

static inline void write_vpr_sleepctrl(uint32_t value) {
  __asm__ volatile("csrw %0, %1" : : "i"(VPRCSR_NORDIC_VPRNORDICSLEEPCTRL), "r"(value));
}

static inline void write_vpr_nordic_ctrl(uint32_t value) {
  __asm__ volatile("csrw %0, %1" : : "i"(VPRCSR_NORDIC_VPRNORDICCTRL), "r"(value));
}

static void bytes_zero(void *dst, size_t len) {
  uint8_t *out = (uint8_t *)dst;
  if (out == NULL) {
    return;
  }
  for (size_t i = 0U; i < len; ++i) {
    out[i] = 0U;
  }
}

static void bytes_copy(void *dst, const void *src, size_t len) {
  uint8_t *out = (uint8_t *)dst;
  const uint8_t *in = (const uint8_t *)src;
  if (out == NULL || in == NULL) {
    return;
  }
  for (size_t i = 0U; i < len; ++i) {
    out[i] = in[i];
  }
}

static void zero_vpr_data(void) {
  for (uint32_t i = 0U; i < NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA; ++i) {
    g_vpr_transport->vprData[i] = 0U;
  }
}

static void clear_retained_hibernate_state(void) {
  g_host_transport->hibernateCookie = 0U;
  g_host_transport->hibernateFlags = 0U;
  g_host_transport->retainedTickerPeriodTicks = 0U;
  g_host_transport->retainedTickerStep = 0U;
  g_host_transport->retainedTickerAccum = 0U;
  g_host_transport->retainedTickerCount = 0U;
}

static void persist_hibernate_state(void) {
  uint32_t flags = NRF54L15_VPR_TRANSPORT_HIBERNATE_FLAG_TICKER_VALID;
  if (g_ticker_enabled != 0U) {
    flags |= NRF54L15_VPR_TRANSPORT_HIBERNATE_FLAG_TICKER_ENABLED;
  }
  g_host_transport->hibernateCookie = NRF54L15_VPR_TRANSPORT_HIBERNATE_COOKIE;
  g_host_transport->hibernateFlags = flags;
  g_host_transport->retainedTickerPeriodTicks = g_ticker_period_ticks;
  g_host_transport->retainedTickerStep = g_ticker_step;
  g_host_transport->retainedTickerAccum = g_ticker_accum;
  g_host_transport->retainedTickerCount = g_ticker_count;
}

static bool restore_hibernate_state(void) {
  if (g_host_transport->hibernateCookie != NRF54L15_VPR_TRANSPORT_HIBERNATE_COOKIE) {
    return false;
  }
  const uint32_t flags = g_host_transport->hibernateFlags;
  if ((flags & NRF54L15_VPR_TRANSPORT_HIBERNATE_FLAG_TICKER_VALID) == 0U) {
    clear_retained_hibernate_state();
    return false;
  }
  g_ticker_enabled =
      (flags & NRF54L15_VPR_TRANSPORT_HIBERNATE_FLAG_TICKER_ENABLED) != 0U ? 1U : 0U;
  g_ticker_period_ticks = g_host_transport->retainedTickerPeriodTicks;
  g_ticker_step = g_host_transport->retainedTickerStep;
  if (g_ticker_step == 0U) {
    g_ticker_step = 1U;
  }
  g_ticker_accum = g_host_transport->retainedTickerAccum;
  g_ticker_count = g_host_transport->retainedTickerCount;
  clear_retained_hibernate_state();
  return true;
}

static void write_le16(uint8_t *dst, uint16_t value) {
  if (dst == NULL) {
    return;
  }
  dst[0] = (uint8_t)(value & 0xFFU);
  dst[1] = (uint8_t)((value >> 8U) & 0xFFU);
}

static void write_le24(uint8_t *dst, uint32_t value) {
  if (dst == NULL) {
    return;
  }
  dst[0] = (uint8_t)(value & 0xFFU);
  dst[1] = (uint8_t)((value >> 8U) & 0xFFU);
  dst[2] = (uint8_t)((value >> 16U) & 0xFFU);
}

static void write_le32(uint8_t *dst, uint32_t value) {
  if (dst == NULL) {
    return;
  }
  dst[0] = (uint8_t)(value & 0xFFU);
  dst[1] = (uint8_t)((value >> 8U) & 0xFFU);
  dst[2] = (uint8_t)((value >> 16U) & 0xFFU);
  dst[3] = (uint8_t)((value >> 24U) & 0xFFU);
}

static uint16_t read_conn_handle(void) {
  if (g_host_transport->hostLen < 6U) {
    return 0x0040U;
  }
  return (uint16_t)g_host_transport->hostData[4] |
         ((uint16_t)g_host_transport->hostData[5] << 8U);
}

static size_t append_h4_command_status(uint8_t *dst, size_t max_len, uint16_t opcode,
                                       uint8_t status) {
  if (dst == NULL || max_len < 7U) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_COMMAND_STATUS;
  dst[2] = 4U;
  dst[3] = status;
  dst[4] = 1U;
  write_le16(&dst[5], opcode);
  return 7U;
}

static size_t append_h4_command_complete(uint8_t *dst, size_t max_len, uint16_t opcode,
                                         uint8_t status) {
  if (dst == NULL || max_len < 7U) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_COMMAND_COMPLETE;
  dst[2] = 4U;
  dst[3] = 1U;
  write_le16(&dst[4], opcode);
  dst[6] = status;
  return 7U;
}

static size_t append_h4_command_complete_payload(uint8_t *dst, size_t max_len,
                                                 uint16_t opcode, const uint8_t *payload,
                                                 size_t payload_len) {
  if (dst == NULL || (payload_len != 0U && payload == NULL) || max_len < (6U + payload_len)) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_COMMAND_COMPLETE;
  dst[2] = (uint8_t)(3U + payload_len);
  dst[3] = 1U;
  write_le16(&dst[4], opcode);
  bytes_copy(&dst[6], payload, payload_len);
  return 6U + payload_len;
}

static size_t append_h4_le_meta(uint8_t *dst, size_t max_len, uint8_t subevent_code,
                                const uint8_t *payload, size_t payload_len) {
  if (dst == NULL || payload == NULL || max_len < (4U + payload_len)) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_LE_META;
  dst[2] = (uint8_t)(1U + payload_len);
  dst[3] = subevent_code;
  bytes_copy(&dst[4], payload, payload_len);
  return 4U + payload_len;
}

static size_t append_h4_vendor_event(uint8_t *dst, size_t max_len, uint8_t subevent_code,
                                     const uint8_t *payload, size_t payload_len) {
  if (dst == NULL || payload == NULL || max_len < (4U + payload_len)) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_VENDOR;
  dst[2] = (uint8_t)(1U + payload_len);
  dst[3] = subevent_code;
  bytes_copy(&dst[4], payload, payload_len);
  return 4U + payload_len;
}

static void append_mode2_demo_step(uint8_t *dst, uint8_t channel) {
  if (dst == NULL) {
    return;
  }
  dst[0] = BLE_CS_MAIN_MODE2;
  dst[1] = channel;
  dst[2] = 5U;
  dst[3] = 0U;
  dst[4] = 0x00U;
  dst[5] = 0x04U;
  dst[6] = 0x00U;
  dst[7] = 0x00U;
}

