lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t build_remote_caps_payload(uint8_t *payload, size_t max_len, uint16_t conn_handle) {
  if (payload == NULL || max_len < 34U) {
    return 0U;
  }
  bytes_zero(payload, 34U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  payload[3] = 4U;
  write_le16(&payload[4], 6U);
  payload[6] = 4U;
  payload[7] = 4U;
  payload[8] = 0x03U;
  payload[9] = 0x01U;
  payload[10] = 0x07U;
  payload[11] = 0x02U;
  payload[12] = 0x03U;
  payload[13] = 0x04U;
  write_le16(&payload[14], 0x0001U);
  write_le16(&payload[16], 0x0001U);
  payload[18] = 0x06U;
  write_le16(&payload[19], 0x001EU);
  write_le16(&payload[21], 10U);
  write_le16(&payload[23], 20U);
  write_le16(&payload[25], 30U);
  write_le16(&payload[27], 40U);
  payload[29] = 3U;
  payload[30] = 4U;
  write_le16(&payload[31], 50U);
  payload[33] = 6U;
  return 34U;
}

static size_t build_security_complete_payload(uint8_t *payload, size_t max_len,
                                              uint16_t conn_handle) {
  if (payload == NULL || max_len < 3U) {
    return 0U;
  }
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  return 3U;
}

static size_t build_config_complete_payload(uint8_t *payload, size_t max_len,
                                            uint16_t conn_handle) {
  static const uint8_t channel_map[10] = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0x1FU,
                                          0x00U, 0x00U, 0x00U, 0x00U, 0x00U};
  if (payload == NULL || max_len < 33U) {
    return 0U;
  }
  bytes_zero(payload, 33U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  payload[3] = 1U;
  payload[4] = 1U;
  payload[5] = BLE_CS_MAIN_MODE2;
  payload[6] = 0xFFU;
  payload[7] = 3U;
  payload[8] = 5U;
  payload[9] = 1U;
  payload[10] = 1U;
  payload[11] = 0U;
  payload[12] = 1U;
  payload[13] = 2U;
  bytes_copy(&payload[14], channel_map, sizeof(channel_map));
  payload[24] = 1U;
  payload[25] = 1U;
  payload[26] = 1U;
  payload[27] = 3U;
  payload[28] = 0x01U;
  payload[29] = 10U;
  payload[30] = 20U;
  payload[31] = 30U;
  payload[32] = 40U;
  return 33U;
}

static size_t build_procedure_enable_complete_payload(uint8_t *payload, size_t max_len,
                                                      uint16_t conn_handle) {
  if (payload == NULL || max_len < 21U) {
    return 0U;
  }
  bytes_zero(payload, 21U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  payload[3] = 1U;
  payload[4] = 1U;
  payload[5] = 2U;
  payload[6] = (uint8_t)(int8_t)-12;
  write_le24(&payload[7], 0x000456UL);
  payload[10] = 4U;
  write_le16(&payload[11], 100U);
  write_le16(&payload[13], 200U);
  write_le16(&payload[15], 300U);
  write_le16(&payload[17], 8U);
  write_le16(&payload[19], 12U);
  return 21U;
}

static size_t build_subevent_initial_payload(uint8_t *payload, size_t max_len,
                                             uint16_t conn_handle) {
  if (payload == NULL || max_len < 31U) {
    return 0U;
  }
  bytes_zero(payload, 31U);
  write_le16(&payload[0], conn_handle);
  payload[2] = 1U;
  write_le16(&payload[3], 0x1234U);
  write_le16(&payload[5], 7U);
  write_le16(&payload[7], 0U);
  payload[9] = 0U;
  payload[10] = 0x01U;
  payload[11] = 0x01U;
  payload[12] = 0U;
  payload[13] = 2U;
  payload[14] = 2U;
  append_mode2_demo_step(&payload[15], 0U);
  append_mode2_demo_step(&payload[23], 12U);
  return 31U;
}

static size_t build_subevent_continue_payload(uint8_t *payload, size_t max_len,
                                              uint16_t conn_handle) {
  if (payload == NULL || max_len < 24U) {
    return 0U;
  }
  bytes_zero(payload, 24U);
  write_le16(&payload[0], conn_handle);
  payload[2] = 1U;
  payload[3] = 0U;
  payload[4] = 0U;
  payload[5] = 0U;
  payload[6] = 2U;
  payload[7] = 2U;
  append_mode2_demo_step(&payload[8], 24U);
  append_mode2_demo_step(&payload[16], 36U);
  return 24U;
}

static uint16_t read_opcode(void) {
  if (g_host_transport->hostLen < 4U) {
    return 0U;
  }
  if (g_host_transport->hostData[0] != 0x01U) {
    return 0U;
  }
  return (uint16_t)g_host_transport->hostData[1] |
         ((uint16_t)g_host_transport->hostData[2] << 8U);
}

static size_t build_vendor_ping_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t echoedCookie = 0U;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen >= 8U) {
    echoedCookie = (uint32_t)g_host_transport->hostData[4] |
                   ((uint32_t)g_host_transport->hostData[5] << 8U) |
                   ((uint32_t)g_host_transport->hostData[6] << 16U) |
                   ((uint32_t)g_host_transport->hostData[7] << 24U);
  }
  payload[0] = 0U;
  write_le32(&payload[1], echoedCookie);
  write_le32(&payload[5], g_vpr_transport->heartbeat);
  return 9U;
}

static size_t build_vendor_info_complete_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 12U) {
    return 0U;
  }
  payload[0] = 0U;
  payload[1] = (uint8_t)(g_vpr_transport->status & 0xFFU);
  payload[2] = (uint8_t)(g_vpr_transport->lastError & 0xFFU);
  payload[3] = (uint8_t)(g_vpr_transport->vprFlags & 0xFFU);
  if (g_restored_from_hibernate != 0U) {
    payload[3] = (uint8_t)(payload[3] | VPR_VENDOR_TRANSPORT_FLAG_RESTORED_FROM_HIBERNATE);
  }
  write_le32(&payload[4], g_vpr_transport->heartbeat);
  write_le32(&payload[8], g_host_transport->scriptCount);
  return 12U;
}

static size_t build_vendor_capabilities_complete_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 11U) {
    return 0U;
  }
  payload[0] = 0U;
  payload[1] = VPR_VENDOR_SERVICE_VERSION_MAJOR;
  payload[2] = VPR_VENDOR_SERVICE_VERSION_MINOR;
  write_le32(&payload[3],
             VPR_VENDOR_OP_PING |
             VPR_VENDOR_OP_INFO |
             VPR_VENDOR_OP_FNV1A32 |
             VPR_VENDOR_OP_CAPABILITIES |
             VPR_VENDOR_OP_CRC32 |
             VPR_VENDOR_OP_CRC32C |
             VPR_VENDOR_OP_TICKER_CONFIGURE |
             VPR_VENDOR_OP_TICKER_READ_STATE |
             VPR_VENDOR_OP_ENTER_HIBERNATE |
             VPR_VENDOR_OP_TICKER_EVENT_CONFIGURE);
  write_le32(&payload[7], NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U);
  return 11U;
}

static uint32_t fnv1a32_bytes(const uint8_t *data, size_t len) {
  uint32_t hash = 2166136261UL;
  if (data == NULL) {
    return hash;
  }
  for (size_t i = 0U; i < len; ++i) {
    hash ^= (uint32_t)data[i];
    hash *= 16777619UL;
  }
  return hash;
}

static size_t build_vendor_fnv1a_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t processedLen = 0U;
  uint32_t hash = 2166136261UL;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen > 4U) {
    processedLen = g_host_transport->hostLen - 4U;
    if (processedLen > (NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U)) {
      processedLen = NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U;
    }
    hash = fnv1a32_bytes((const uint8_t *)&g_host_transport->hostData[4], processedLen);
  }
  payload[0] = 0U;
  write_le32(&payload[1], hash);
  write_le32(&payload[5], processedLen);
  return 9U;
}

static uint32_t crc32_bytes(const uint8_t *data, size_t len) {
  uint32_t crc = 0xFFFFFFFFUL;
  if (data == NULL) {
    return crc ^ 0xFFFFFFFFUL;
  }
  for (size_t i = 0U; i < len; ++i) {
    crc ^= (uint32_t)data[i];
    for (uint8_t bit = 0U; bit < 8U; ++bit) {
      const uint32_t mask = -(crc & 1U);
      crc = (crc >> 1U) ^ (0xEDB88320UL & mask);
    }
  }
  return crc ^ 0xFFFFFFFFUL;
}

static size_t build_vendor_crc32_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t processedLen = 0U;
  uint32_t crc = 0U;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen > 4U) {
    processedLen = g_host_transport->hostLen - 4U;
    if (processedLen > (NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U)) {
      processedLen = NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U;
    }
    crc = crc32_bytes((const uint8_t *)&g_host_transport->hostData[4], processedLen);
  }
  payload[0] = 0U;
  write_le32(&payload[1], crc);
  write_le32(&payload[5], processedLen);
  return 9U;
}

static uint32_t crc32c_bytes(const uint8_t *data, size_t len) {
  uint32_t crc = 0xFFFFFFFFUL;
  if (data == NULL) {
    return crc ^ 0xFFFFFFFFUL;
  }
  for (size_t i = 0U; i < len; ++i) {
    crc ^= (uint32_t)data[i];
    for (uint8_t bit = 0U; bit < 8U; ++bit) {
      const uint32_t mask = -(crc & 1U);
      crc = (crc >> 1U) ^ (0x82F63B78UL & mask);
    }
  }
  return crc ^ 0xFFFFFFFFUL;
}

static size_t build_vendor_crc32c_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t processedLen = 0U;
  uint32_t crc = 0U;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen > 4U) {
    processedLen = g_host_transport->hostLen - 4U;
    if (processedLen > (NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U)) {
      processedLen = NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U;
    }
    crc = crc32c_bytes((const uint8_t *)&g_host_transport->hostData[4], processedLen);
  }
  payload[0] = 0U;
  write_le32(&payload[1], crc);
  write_le32(&payload[5], processedLen);
  return 9U;
}

