lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t build_vendor_ticker_state_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 14U) {
    return 0U;
  }
  payload[0] = 0U;
  payload[1] = (uint8_t)(g_ticker_enabled != 0U ? 1U : 0U);
  write_le32(&payload[2], g_ticker_period_ticks);
  write_le32(&payload[6], g_ticker_step);
  write_le32(&payload[10], g_ticker_count);
  return 14U;
}

static size_t build_vendor_ticker_configure_complete_payload(uint8_t *payload, size_t max_len) {
  if (g_host_transport->hostLen >= 13U) {
    g_ticker_enabled = g_host_transport->hostData[4] != 0U ? 1U : 0U;
    g_ticker_period_ticks = (uint32_t)g_host_transport->hostData[5] |
                            ((uint32_t)g_host_transport->hostData[6] << 8U) |
                            ((uint32_t)g_host_transport->hostData[7] << 16U) |
                            ((uint32_t)g_host_transport->hostData[8] << 24U);
    g_ticker_step = (uint32_t)g_host_transport->hostData[9] |
                    ((uint32_t)g_host_transport->hostData[10] << 8U) |
                    ((uint32_t)g_host_transport->hostData[11] << 16U) |
                    ((uint32_t)g_host_transport->hostData[12] << 24U);
    if (g_ticker_step == 0U) {
      g_ticker_step = 1U;
    }
    g_ticker_accum = 0U;
    g_ticker_count = 0U;
    if (g_ticker_period_ticks == 0U) {
      g_ticker_enabled = 0U;
    }
  }
  return build_vendor_ticker_state_payload(payload, max_len);
}

static size_t build_vendor_ticker_event_configure_complete_payload(uint8_t *payload,
                                                                   size_t max_len) {
  if (payload == NULL || max_len < 14U) {
    return 0U;
  }
  if (g_host_transport->hostLen >= 9U) {
    g_ticker_event_enabled = g_host_transport->hostData[4] != 0U ? 1U : 0U;
    g_ticker_event_emit_every = (uint32_t)g_host_transport->hostData[5] |
                                ((uint32_t)g_host_transport->hostData[6] << 8U) |
                                ((uint32_t)g_host_transport->hostData[7] << 16U) |
                                ((uint32_t)g_host_transport->hostData[8] << 24U);
    if (g_ticker_event_emit_every == 0U) {
      g_ticker_event_enabled = 0U;
    }
    g_ticker_event_last_emitted_count = g_ticker_count;
    g_ticker_event_pending_count = 0U;
    g_ticker_event_drop_count = 0U;
  }
  payload[0] = 0U;
  payload[1] = (uint8_t)(g_ticker_event_enabled != 0U ? 1U : 0U);
  write_le32(&payload[2], g_ticker_event_emit_every);
  write_le32(&payload[6], g_ticker_event_last_emitted_count);
  write_le32(&payload[10], g_ticker_event_drop_count);
  return 14U;
}

static size_t build_vendor_ticker_event_payload(uint8_t *payload, size_t max_len,
                                                uint32_t event_count) {
  if (payload == NULL || max_len < 13U) {
    return 0U;
  }
  payload[0] = 0U;
  write_le32(&payload[1], event_count);
  write_le32(&payload[5], g_ticker_step);
  write_le32(&payload[9], g_vpr_transport->heartbeat);
  return 13U;
}

static size_t build_vendor_enter_hibernate_complete_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 5U) {
    return 0U;
  }
  payload[0] = 0U;
  write_le32(&payload[1], g_vpr_transport->heartbeat);
  persist_hibernate_state();
  g_pending_hibernate = 1U;
  return 5U;
}

static void build_unknown_command_response(uint16_t opcode) {
  zero_vpr_data();
  g_vpr_transport->vprData[0] = 0x04U;
  g_vpr_transport->vprData[1] = 0x0EU;
  g_vpr_transport->vprData[2] = 4U;
  g_vpr_transport->vprData[3] = 1U;
  g_vpr_transport->vprData[4] = (uint8_t)(opcode & 0xFFU);
  g_vpr_transport->vprData[5] = (uint8_t)((opcode >> 8U) & 0xFFU);
  g_vpr_transport->vprData[6] = 0x01U;
  g_vpr_transport->vprLen = 7U;
}

static bool publish_builtin_response_for_opcode(uint16_t opcode) {
  uint8_t payload[40];
  uint16_t conn_handle = read_conn_handle();
  size_t offset = 0U;
  zero_vpr_data();

  switch (opcode) {
    case BLE_CS_HCI_OP_READ_REMOTE_SUPPORTED_CAPABILITIES: {
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, 0U);
      if (len == 0U) {
        return false;
      }
      offset += len;
      len = build_remote_caps_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_READ_REMOTE_SUPPORTED_CAPS_COMPLETE_V2, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_SET_DEFAULT_SETTINGS: {
      size_t len = append_h4_command_complete((uint8_t *)g_vpr_transport->vprData + offset,
                                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                              opcode, 0U);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_CREATE_CONFIG: {
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, 0U);
      if (len == 0U) {
        return false;
      }
      offset += len;
      len = build_config_complete_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_CONFIG_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_SECURITY_ENABLE: {
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, 0U);
      if (len == 0U) {
        return false;
      }
      offset += len;
      len = build_security_complete_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_SECURITY_ENABLE_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_SET_PROCEDURE_PARAMETERS: {
      size_t len = append_h4_command_complete((uint8_t *)g_vpr_transport->vprData + offset,
                                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                              opcode, 0U);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_PROCEDURE_ENABLE: {
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, 0U);
      if (len == 0U) {
        return false;
      }
      offset += len;
      len = build_procedure_enable_complete_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_PROCEDURE_ENABLE_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      len = build_subevent_initial_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_SUBEVENT_RESULT, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      len = build_subevent_continue_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_SUBEVENT_RESULT_CONTINUE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_PING: {
      size_t len = build_vendor_ping_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_GET_TRANSPORT_INFO: {
      size_t len = build_vendor_info_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_FNV1A32: {
      size_t len = build_vendor_fnv1a_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_GET_CAPABILITIES: {
      size_t len = build_vendor_capabilities_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_CRC32: {
      size_t len = build_vendor_crc32_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_CRC32C: {
      size_t len = build_vendor_crc32c_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_TICKER_CONFIGURE: {
      size_t len = build_vendor_ticker_configure_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_TICKER_READ_STATE: {
      size_t len = build_vendor_ticker_state_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_ENTER_HIBERNATE: {
      size_t len = build_vendor_enter_hibernate_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_TICKER_EVENT_CONFIGURE: {
      size_t len = build_vendor_ticker_event_configure_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    default:
      return false;
  }

  g_vpr_transport->vprLen = (uint32_t)offset;
  return true;
}

