lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static void publish_response_for_opcode(uint16_t opcode) {
  const uint32_t count =
      (g_host_transport->scriptCount <= NRF54L15_VPR_TRANSPORT_MAX_SCRIPT_COUNT)
          ? g_host_transport->scriptCount
          : NRF54L15_VPR_TRANSPORT_MAX_SCRIPT_COUNT;

  g_vpr_transport->lastOpcode = (uint32_t)opcode;
  for (uint32_t i = 0U; i < count; ++i) {
    volatile const Nrf54l15VprTransportScript* script = &g_host_transport->scripts[i];
    if (script->opcode != opcode) {
      continue;
    }

    if (script->responseLen > NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA) {
      g_vpr_transport->lastError = 2U;
      g_vpr_transport->status = NRF54L15_VPR_TRANSPORT_STATUS_ERROR;
      g_vpr_transport->vprLen = 0U;
      return;
    }

    zero_vpr_data();
    bytes_copy((void *)g_vpr_transport->vprData, (const void *)script->response,
               script->responseLen);
    g_vpr_transport->vprLen = script->responseLen;
    return;
  }

  if (!publish_builtin_response_for_opcode(opcode)) {
    build_unknown_command_response(opcode);
  }
}

static bool publish_pending_ticker_event(void) {
  uint8_t payload[16];
  size_t len = 0U;
  if (g_ticker_event_pending_count == 0U ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ||
      host_request_pending()) {
    return false;
  }
  zero_vpr_data();
  len = build_vendor_ticker_event_payload(payload, sizeof(payload), g_ticker_event_pending_count);
  if (len == 0U) {
    return false;
  }
  len = append_h4_vendor_event((uint8_t *)g_vpr_transport->vprData,
                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA,
                               VPR_VENDOR_EVENT_TICKER, payload, len);
  if (len == 0U) {
    return false;
  }
  g_vpr_transport->vprLen = (uint32_t)len;
  g_vpr_transport->vprSeq = g_vpr_transport->vprSeq + 1U;
  g_vpr_transport->vprFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  g_ticker_event_last_emitted_count = g_ticker_event_pending_count;
  g_ticker_event_pending_count = 0U;
  return true;
}

static bool host_request_pending(void) {
  return ((g_host_transport->hostFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U) ||
         (g_host_transport->hostLen != 0U);
}

static bool consume_host_request(uint32_t host_seq) {
  if (!host_request_pending()) {
    return false;
  }

  const uint16_t opcode = read_opcode();
  publish_response_for_opcode(opcode);
  g_vpr_transport->vprSeq = host_seq;
  g_vpr_transport->vprFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  g_host_transport->hostFlags = 0U;
  g_host_transport->hostLen = 0U;
  g_vpr_transport->status = NRF54L15_VPR_TRANSPORT_STATUS_READY;
  fence_rw();
  return true;
}

__attribute__((noreturn)) void vpr_main(void) {
  uint32_t last_seq = 0U;
  const bool restored_from_hibernate = restore_hibernate_state();
  g_restored_from_hibernate = restored_from_hibernate ? 1U : 0U;
  const uint32_t nordic_ctrl =
      (VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Enabled
       << VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos) |
      VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Msk;

  write_vpr_nordic_ctrl(nordic_ctrl);
  fence_rw();

  g_host_transport->magic = NRF54L15_VPR_TRANSPORT_MAGIC;
  g_host_transport->version = NRF54L15_VPR_TRANSPORT_VERSION;
  g_vpr_transport->magic = NRF54L15_VPR_TRANSPORT_MAGIC;
  g_vpr_transport->version = NRF54L15_VPR_TRANSPORT_VERSION;
  g_vpr_transport->status = NRF54L15_VPR_TRANSPORT_STATUS_READY;
  g_vpr_transport->heartbeat = 0U;
  g_vpr_transport->vprFlags = 0U;
  g_vpr_transport->vprLen = 0U;
  g_vpr_transport->lastError = 0U;
  g_vpr_transport->reserved = g_restored_from_hibernate;
  if (!restored_from_hibernate) {
    g_ticker_enabled = 0U;
    g_ticker_period_ticks = 0U;
    g_ticker_step = 1U;
    g_ticker_accum = 0U;
    g_ticker_count = 0U;
    g_ticker_event_enabled = 0U;
    g_ticker_event_emit_every = 0U;
    g_ticker_event_last_emitted_count = 0U;
    g_ticker_event_pending_count = 0U;
    g_ticker_event_drop_count = 0U;
  }
  g_pending_hibernate = 0U;
  fence_rw();

  while (1) {
    g_vpr_transport->heartbeat = g_vpr_transport->heartbeat + 1U;
    if (g_ticker_enabled != 0U && g_ticker_period_ticks != 0U) {
      g_ticker_accum = g_ticker_accum + 1U;
      if (g_ticker_accum >= g_ticker_period_ticks) {
        g_ticker_accum = 0U;
        g_ticker_count = g_ticker_count + g_ticker_step;
        if (g_ticker_event_enabled != 0U && g_ticker_event_emit_every != 0U &&
            g_ticker_count >= (g_ticker_event_last_emitted_count + g_ticker_event_emit_every)) {
          if (g_ticker_event_pending_count != 0U) {
            g_ticker_event_drop_count = g_ticker_event_drop_count + 1U;
          }
          g_ticker_event_pending_count = g_ticker_count;
        }
      }
    }
    fence_rw();

    const uint32_t host_seq = g_host_transport->hostSeq;
    const uint32_t host_flags = g_host_transport->hostFlags;
    g_vpr_transport->reserved =
        ((host_seq & 0xFFFFU) << 16U) |
        ((host_flags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ? 0x2U : 0U) |
        0x4U;
    fence_rw();

    if ((host_seq != last_seq) && host_request_pending()) {
      if (consume_host_request(host_seq)) {
        last_seq = host_seq;
      }
    }

    if ((g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) == 0U &&
        !host_request_pending()) {
      (void)publish_pending_ticker_event();
    }

    if (g_pending_hibernate != 0U &&
        (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) == 0U) {
      g_pending_hibernate = 0U;
      fence_rw();
      write_vpr_sleepctrl(VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_HIBERNATE |
                          VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Msk);
      fence_rw();
      /* Nordic documents that VPR wake can fail if WFI is entered with MIE clear. */
      enable_machine_interrupts();
      __asm__ volatile("wfi");
    }
  }
}

__attribute__((naked, noreturn, section(".text.start"))) void _start(void) {
  __asm__ volatile(
      "li gp, 0\n"
      "la sp, __stack_top\n"
      "j vpr_main\n");
}
